import streamlit as st

#ส่วนที่1 หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown("# :red[💪 คำนวณค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลนํ้าหนักเเละส่วนสูงของคุณ📋 เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่2 สร้างช่องรับค่านํ้าหนักเเละส่วนสูงของคูณ ⚖️ เเละส่วนสูง
weight = st.number_input("กรอกนํ้าหนักของคุณ (กิโลกรัม):", min_value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซ็นติเมตร):", min_value=1.0)

#ส่วนที่3 สร้างปุ่มกด
if st.button("คำนวญค่า BMI 🪙 "):
   # แปลงส่วนสูง cm เป็น เมตร แล้วคำนวณ BMI
   height_m = height_cm / 100
   bmi = weight / (height_m ** 2)

   st.write("___")
   st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่4 แปลงผลค่า BMI ตามเกณฑ์
   if bmi < 18.5:
       st.warning("❤️‍🩹 คุณมีนํ้าหนักน้อยกว่าเกณฑ์ (ผอม)")
   elif 18.5 <= bmi < 23.0:
       st.success("👍 คุณมีนํ้าหนักอยู่ในเกณฑ์ปกติ (สุขภาพดีเยี่ยม)")
   elif 23.0 <= bmi < 25.0:
       st.info("👎 คุณเริ่มมีนํ้าหนักเกินเกณฑ์ (ท้วม)")
   elif:
       st.error("♚ คุณอยู่ในเกณฑ์อ้วน ระวังเรื่องสุขภาพเเละออกกำลังกายด้วย")

st.divider()
st.write("นายอัครชัย ติสนธิ ม.4/13 เลขที่7 ✨")
